sebanc/brunch/external-drivers/rtl8723du/core/rtw_mi.c
	if (state == WIFI_MONITOR_STATE || state == 0xFFFFFFFF)
		return;
	rtw_mi_status(adapter, &tmp_mstate);
	memcpy(iface_state, &tmp_mstate, sizeof(struct mi_state));

	if (rtw_mi_get_ch_setting_union(adapter, &u_ch, &u_bw, &u_offset))
		rtw_mi_update_union_chan_inf(adapter , u_ch, u_offset , u_bw);
}

u8 rtw_mi_check_status(struct adapter *adapter, u8 type)
{
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapter);
	struct mi_state *iface_state = &dvobj->iface_state;
	u8 ret = false;

	switch (type) {
	case MI_LINKED:
		if (MSTATE_STA_LD_NUM(iface_state) || MSTATE_AP_NUM(iface_state) || MSTATE_ADHOC_NUM(iface_state) || MSTATE_MESH_NUM(iface_state)) /*check_fwstate(&iface->mlmepriv, _FW_LINKED)*/
			ret = true;
		break;
	case MI_ASSOC:
		if (MSTATE_STA_LD_NUM(iface_state) || MSTATE_AP_LD_NUM(iface_state) || MSTATE_ADHOC_LD_NUM(iface_state) || MSTATE_MESH_LD_NUM(iface_state))
			ret = true;
		break;
	case MI_UNDER_WPS:
		if (MSTATE_WPS_NUM(iface_state))
			ret = true;
		break;

	case MI_AP_MODE:
		if (MSTATE_AP_NUM(iface_state))
			ret = true;
		break;
	case MI_AP_ASSOC:
		if (MSTATE_AP_LD_NUM(iface_state))
			ret = true;
		break;

	case MI_ADHOC:
		if (MSTATE_ADHOC_NUM(iface_state))
			ret = true;
		break;
	case MI_ADHOC_ASSOC:
		if (MSTATE_ADHOC_LD_NUM(iface_state))
			ret = true;
		break;

#ifdef CONFIG_RTW_MESH
	case MI_MESH:
		if (MSTATE_MESH_NUM(iface_state))
			ret = true;
		break;
	case MI_MESH_ASSOC:
		if (MSTATE_MESH_LD_NUM(iface_state))
			ret = true;
		break;
#endif

	case MI_STA_NOLINK: /* this is misleading, but not used now */
		if (MSTATE_STA_NUM(iface_state) && (!(MSTATE_STA_LD_NUM(iface_state) || MSTATE_STA_LG_NUM(iface_state))))
			ret = true;
		break;
	case MI_STA_LINKED:
		if (MSTATE_STA_LD_NUM(iface_state))
			ret = true;
		break;
	case MI_STA_LINKING:
		if (MSTATE_STA_LG_NUM(iface_state))
			ret = true;
		break;

	default:
		break;
	}
	return ret;
}

/*
* return value : 0 is failed or have not interface meet condition
* return value : !0 is success or interface numbers which meet condition
* return value of ops_func must be true or false
*/
static u8 _rtw_mi_process(struct adapter *adapt, bool exclude_self,
		  void *data, u8(*ops_func)(struct adapter *adapt, void *data))
{
	int i;
	struct adapter *iface;
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapt);

	u8 ret = 0;

	for (i = 0; i < dvobj->iface_nums; i++) {
		iface = dvobj->adapters[i];
		if ((iface) && rtw_is_adapter_up(iface)) {

			if ((exclude_self) && (iface == adapt))
				continue;

			if (ops_func)
				if (ops_func(iface, data))
					ret++;
		}
	}
	return ret;
}
static u8 _rtw_mi_process_without_schk(struct adapter *adapt, bool exclude_self,
		  void *data, u8(*ops_func)(struct adapter *adapt, void *data))
{
	int i;
	struct adapter *iface;
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapt);

	u8 ret = 0;

	for (i = 0; i < dvobj->iface_nums; i++) {
		iface = dvobj->adapters[i];
		if (iface) {
			if ((exclude_self) && (iface == adapt))
				continue;

			if (ops_func)
				if (ops_func(iface, data))
					ret++;
		}
	}
	return ret;
}

static u8 _rtw_mi_netif_caroff_qstop(struct adapter *adapt, void *data)
{
	struct net_device *pnetdev = adapt->pnetdev;

	rtw_netif_carrier_off(pnetdev);
	rtw_netif_stop_queue(pnetdev);
	return true;
}
u8 rtw_mi_netif_caroff_qstop(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_netif_caroff_qstop);
}
u8 rtw_mi_buddy_netif_caroff_qstop(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_netif_caroff_qstop);
}

static u8 _rtw_mi_netif_caron_qstart(struct adapter *adapt, void *data)
{
	struct net_device *pnetdev = adapt->pnetdev;

	rtw_netif_carrier_on(pnetdev);
	rtw_netif_start_queue(pnetdev);
	return true;
}
u8 rtw_mi_netif_caron_qstart(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_netif_caron_qstart);
}
u8 rtw_mi_buddy_netif_caron_qstart(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_netif_caron_qstart);
}

static u8 _rtw_mi_netif_stop_queue(struct adapter *adapt, void *data)
{
	struct net_device *pnetdev = adapt->pnetdev;

	rtw_netif_stop_queue(pnetdev);
	return true;
}
u8 rtw_mi_netif_stop_queue(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_netif_stop_queue);
}
u8 rtw_mi_buddy_netif_stop_queue(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_netif_stop_queue);
}

static u8 _rtw_mi_netif_wake_queue(struct adapter *adapt, void *data)
{
	struct net_device *pnetdev = adapt->pnetdev;

	if (pnetdev)
		rtw_netif_wake_queue(pnetdev);
	return true;
}
u8 rtw_mi_netif_wake_queue(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_netif_wake_queue);
}
u8 rtw_mi_buddy_netif_wake_queue(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_netif_wake_queue);
}

static u8 _rtw_mi_netif_carrier_on(struct adapter *adapt, void *data)
{
	struct net_device *pnetdev = adapt->pnetdev;

	if (pnetdev)
		rtw_netif_carrier_on(pnetdev);
	return true;
}
u8 rtw_mi_netif_carrier_on(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_netif_carrier_on);
}
u8 rtw_mi_buddy_netif_carrier_on(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_netif_carrier_on);
}

static u8 _rtw_mi_netif_carrier_off(struct adapter *adapt, void *data)
{
	struct net_device *pnetdev = adapt->pnetdev;

	if (pnetdev)
		rtw_netif_carrier_off(pnetdev);
	return true;
}
u8 rtw_mi_netif_carrier_off(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_netif_carrier_off);
}
u8 rtw_mi_buddy_netif_carrier_off(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_netif_carrier_off);
}

static u8 _rtw_mi_scan_abort(struct adapter *adapter, void *data)
{
	bool bwait = *(bool *)data;

	if (bwait)
		rtw_scan_abort(adapter);
	else
		rtw_scan_abort_no_wait(adapter);

	return true;
}
void rtw_mi_scan_abort(struct adapter *adapter, bool bwait)
{
	bool in_data = bwait;

	_rtw_mi_process(adapter, false, &in_data, _rtw_mi_scan_abort);

