sebanc/brunch/external-drivers/rtl8723du/core/rtw_mi.c
}
void rtw_mi_buddy_scan_abort(struct adapter *adapter, bool bwait)
{
	bool in_data = bwait;

	_rtw_mi_process(adapter, true, &in_data, _rtw_mi_scan_abort);
}

static u32 _rtw_mi_start_drv_threads(struct adapter *adapter, bool exclude_self)
{
	int i;
	struct adapter *iface = NULL;
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapter);
	u32 _status = _SUCCESS;

	for (i = 0; i < dvobj->iface_nums; i++) {
		iface = dvobj->adapters[i];
		if (iface) {
			if ((exclude_self) && (iface == adapter))
				continue;
			if (rtw_start_drv_threads(iface) == _FAIL) {
				_status = _FAIL;
				break;
			}
		}
	}
	return _status;
}
u32 rtw_mi_start_drv_threads(struct adapter *adapter)
{
	return _rtw_mi_start_drv_threads(adapter, false);
}
u32 rtw_mi_buddy_start_drv_threads(struct adapter *adapter)
{
	return _rtw_mi_start_drv_threads(adapter, true);
}

static void _rtw_mi_stop_drv_threads(struct adapter *adapter, bool exclude_self)
{
	int i;
	struct adapter *iface = NULL;
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapter);

	for (i = 0; i < dvobj->iface_nums; i++) {
		iface = dvobj->adapters[i];
		if (iface) {
			if ((exclude_self) && (iface == adapter))
				continue;
			rtw_stop_drv_threads(iface);
		}
	}
}
void rtw_mi_stop_drv_threads(struct adapter *adapter)
{
	_rtw_mi_stop_drv_threads(adapter, false);
}
void rtw_mi_buddy_stop_drv_threads(struct adapter *adapter)
{
	_rtw_mi_stop_drv_threads(adapter, true);
}

static u8 _rtw_mi_cancel_all_timer(struct adapter *adapter, void *data)
{
	rtw_cancel_all_timer(adapter);
	return true;
}
void rtw_mi_cancel_all_timer(struct adapter *adapter)
{
	_rtw_mi_process(adapter, false, NULL, _rtw_mi_cancel_all_timer);
}
void rtw_mi_buddy_cancel_all_timer(struct adapter *adapter)
{
	_rtw_mi_process(adapter, true, NULL, _rtw_mi_cancel_all_timer);
}

static u8 _rtw_mi_reset_drv_sw(struct adapter *adapter, void *data)
{
	rtw_reset_drv_sw(adapter);
	return true;
}
void rtw_mi_reset_drv_sw(struct adapter *adapter)
{
	_rtw_mi_process_without_schk(adapter, false, NULL, _rtw_mi_reset_drv_sw);
}
void rtw_mi_buddy_reset_drv_sw(struct adapter *adapter)
{
	_rtw_mi_process_without_schk(adapter, true, NULL, _rtw_mi_reset_drv_sw);
}

static u8 _rtw_mi_intf_start(struct adapter *adapter, void *data)
{
	rtw_intf_start(adapter);
	return true;
}
void rtw_mi_intf_start(struct adapter *adapter)
{
	_rtw_mi_process(adapter, false, NULL, _rtw_mi_intf_start);
}
void rtw_mi_buddy_intf_start(struct adapter *adapter)
{
	_rtw_mi_process(adapter, true, NULL, _rtw_mi_intf_start);
}

static u8 _rtw_mi_intf_stop(struct adapter *adapter, void *data)
{
	rtw_intf_stop(adapter);
	return true;
}
void rtw_mi_intf_stop(struct adapter *adapter)
{
	_rtw_mi_process(adapter, false, NULL, _rtw_mi_intf_stop);
}
void rtw_mi_buddy_intf_stop(struct adapter *adapter)
{
	_rtw_mi_process(adapter, true, NULL, _rtw_mi_intf_stop);
}

static u8 _rtw_mi_suspend_free_assoc_resource(struct adapter *adapt, void *data)
{
	return rtw_suspend_free_assoc_resource(adapt);
}
void rtw_mi_suspend_free_assoc_resource(struct adapter *adapter)
{
	_rtw_mi_process(adapter, false, NULL, _rtw_mi_suspend_free_assoc_resource);
}
void rtw_mi_buddy_suspend_free_assoc_resource(struct adapter *adapter)
{
	_rtw_mi_process(adapter, true, NULL, _rtw_mi_suspend_free_assoc_resource);
}

static u8 _rtw_mi_is_scan_deny(struct adapter *adapter, void *data)
{
	return rtw_is_scan_deny(adapter);
}

u8 rtw_mi_is_scan_deny(struct adapter *adapter)
{
	return _rtw_mi_process(adapter, false, NULL, _rtw_mi_is_scan_deny);

}
u8 rtw_mi_buddy_is_scan_deny(struct adapter *adapter)
{
	return _rtw_mi_process(adapter, true, NULL, _rtw_mi_is_scan_deny);
}

static u8 _rtw_mi_set_scan_deny(struct adapter *adapter, void *data)
{
	u32 ms = *(u32 *)data;

	rtw_set_scan_deny(adapter, ms);
	return true;
}
void rtw_mi_set_scan_deny(struct adapter *adapter, u32 ms)
{
	u32 in_data = ms;

	_rtw_mi_process(adapter, false, &in_data, _rtw_mi_set_scan_deny);
}
void rtw_mi_buddy_set_scan_deny(struct adapter *adapter, u32 ms)
{
	u32 in_data = ms;

	_rtw_mi_process(adapter, true, &in_data, _rtw_mi_set_scan_deny);
}

static u8 _rtw_mi_beacon_update(struct adapter *adapt, void *data)
{
	if (!MLME_IS_STA(adapt)
	    && check_fwstate(&adapt->mlmepriv, _FW_LINKED)) {
		RTW_INFO(ADPT_FMT" - update_beacon\n", ADPT_ARG(adapt));
		update_beacon(adapt, 0xFF, NULL, true);
	}
	return true;
}

void rtw_mi_beacon_update(struct adapter *adapt)
{
	_rtw_mi_process(adapt, false, NULL, _rtw_mi_beacon_update);
}

void rtw_mi_buddy_beacon_update(struct adapter *adapt)
{
	_rtw_mi_process(adapt, true, NULL, _rtw_mi_beacon_update);
}

static u8 _rtw_mi_hal_dump_macaddr(struct adapter *adapt, void *data)
{
	u8 mac_addr[ETH_ALEN] = {0};

	rtw_hal_get_hwreg(adapt, HW_VAR_MAC_ADDR, mac_addr);
	RTW_INFO(ADPT_FMT"MAC Address ="MAC_FMT"\n", ADPT_ARG(adapt), MAC_ARG(mac_addr));
	return true;
}
void rtw_mi_hal_dump_macaddr(struct adapter *adapt)
{
	_rtw_mi_process(adapt, false, NULL, _rtw_mi_hal_dump_macaddr);
}
void rtw_mi_buddy_hal_dump_macaddr(struct adapter *adapt)
{
	_rtw_mi_process(adapt, true, NULL, _rtw_mi_hal_dump_macaddr);
}

static u8 _rtw_mi_busy_traffic_check(struct adapter *adapt, void *data)
{
	u32 passtime;
	struct mlme_priv *pmlmepriv = &adapt->mlmepriv;
	bool check_sc_interval = *(bool *)data;

	if (pmlmepriv->LinkDetectInfo.bBusyTraffic) {
		if (check_sc_interval) {
			/* Miracast can't do AP scan*/
			passtime = rtw_get_passing_time_ms(pmlmepriv->lastscantime);
			pmlmepriv->lastscantime = rtw_get_current_time();
			if (passtime > BUSY_TRAFFIC_SCAN_DENY_PERIOD) {
				RTW_INFO(ADPT_FMT" bBusyTraffic\n", ADPT_ARG(adapt));
				return true;
			}
		} else
			return true;
	}

	return false;
}

u8 rtw_mi_busy_traffic_check(struct adapter *adapt, bool check_sc_interval)
{
	bool in_data = check_sc_interval;

	return _rtw_mi_process(adapt, false, &in_data, _rtw_mi_busy_traffic_check);
}
u8 rtw_mi_buddy_busy_traffic_check(struct adapter *adapt, bool check_sc_interval)
{
	bool in_data = check_sc_interval;

	return _rtw_mi_process(adapt, true, &in_data, _rtw_mi_busy_traffic_check);
}
static u8 _rtw_mi_check_mlmeinfo_state(struct adapter *adapt, void *data)
{
	u32 state = *(u32 *)data;
	struct mlme_ext_priv *mlmeext = &adapt->mlmeextpriv;

	/*if (mlmeext_msr(mlmeext) == state)*/
	if (check_mlmeinfo_state(mlmeext, state))
		return true;
	else
		return false;
}

u8 rtw_mi_check_mlmeinfo_state(struct adapter *adapt, u32 state)
{
	u32 in_data = state;

	return _rtw_mi_process(adapt, false, &in_data, _rtw_mi_check_mlmeinfo_state);
}

u8 rtw_mi_buddy_check_mlmeinfo_state(struct adapter *adapt, u32 state)
{
	u32 in_data = state;

	return _rtw_mi_process(adapt, true, &in_data, _rtw_mi_check_mlmeinfo_state);
}

