sebanc/brunch/external-drivers/rtl8723du/core/rtw_mi.c
static u8 _rtw_mi_check_fwstate(struct adapter *adapt, void *data)
{
	u8 ret = false;

	int state = *(int *)data;

	if ((state == WIFI_FW_NULL_STATE) &&
	    (adapt->mlmepriv.fw_state == WIFI_FW_NULL_STATE))
		ret = true;
	else if (check_fwstate(&adapt->mlmepriv, state))
		ret = true;
	return ret;
}
u8 rtw_mi_check_fwstate(struct adapter *adapt, int state)
{
	int in_data = state;

	return _rtw_mi_process(adapt, false, &in_data, _rtw_mi_check_fwstate);
}
u8 rtw_mi_buddy_check_fwstate(struct adapter *adapt, int state)
{
	int in_data = state;

	return _rtw_mi_process(adapt, true, &in_data, _rtw_mi_check_fwstate);
}

static u8 _rtw_mi_traffic_statistics(struct adapter *adapt , void *data)
{
	struct dvobj_priv	*pdvobjpriv = adapter_to_dvobj(adapt);

	/* Tx */
	pdvobjpriv->traffic_stat.tx_bytes += adapt->xmitpriv.tx_bytes;
	pdvobjpriv->traffic_stat.tx_pkts += adapt->xmitpriv.tx_pkts;
	pdvobjpriv->traffic_stat.tx_drop += adapt->xmitpriv.tx_drop;

	/* Rx */
	pdvobjpriv->traffic_stat.rx_bytes += adapt->recvpriv.rx_bytes;
	pdvobjpriv->traffic_stat.rx_pkts += adapt->recvpriv.rx_pkts;
	pdvobjpriv->traffic_stat.rx_drop += adapt->recvpriv.rx_drop;
	return true;
}
u8 rtw_mi_traffic_statistics(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_traffic_statistics);
}

static u8 _rtw_mi_check_miracast_enabled(struct adapter *adapt , void *data)
{
	return is_miracast_enabled(adapt);
}
u8 rtw_mi_check_miracast_enabled(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_check_miracast_enabled);
}

static void _rtw_mi_adapter_reset(struct adapter *adapt , u8 exclude_self)
{
	int i;
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapt);

	for (i = 0; i < dvobj->iface_nums; i++) {
		if (dvobj->adapters[i]) {
			if ((exclude_self) && (dvobj->adapters[i] == adapt))
				continue;
			dvobj->adapters[i] = NULL;
		}
	}
}

void rtw_mi_adapter_reset(struct adapter *adapt)
{
	_rtw_mi_adapter_reset(adapt, false);
}

void rtw_mi_buddy_adapter_reset(struct adapter *adapt)
{
	_rtw_mi_adapter_reset(adapt, true);
}

static u8 _rtw_mi_dynamic_check_timer_handlder(struct adapter *adapter, void *data)
{
	rtw_iface_dynamic_check_timer_handlder(adapter);
	return true;
}
u8 rtw_mi_dynamic_check_timer_handlder(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_dynamic_check_timer_handlder);
}
u8 rtw_mi_buddy_dynamic_check_timer_handlder(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_dynamic_check_timer_handlder);
}

static u8 _rtw_mi_dev_unload(struct adapter *adapter, void *data)
{
	rtw_dev_unload(adapter);
	return true;
}
u8 rtw_mi_dev_unload(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_dev_unload);
}
u8 rtw_mi_buddy_dev_unload(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_dev_unload);
}

static u8 _rtw_mi_dynamic_chk_wk_hdl(struct adapter *adapter, void *data)
{
	rtw_iface_dynamic_chk_wk_hdl(adapter);
	return true;
}
u8 rtw_mi_dynamic_chk_wk_hdl(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_dynamic_chk_wk_hdl);
}
u8 rtw_mi_buddy_dynamic_chk_wk_hdl(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_dynamic_chk_wk_hdl);
}

static u8 _rtw_mi_os_xmit_schedule(struct adapter *adapter, void *data)
{
	rtw_os_xmit_schedule(adapter);
	return true;
}
u8 rtw_mi_os_xmit_schedule(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_os_xmit_schedule);
}
u8 rtw_mi_buddy_os_xmit_schedule(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_os_xmit_schedule);
}

static u8 _rtw_mi_report_survey_event(struct adapter *adapter, void *data)
{
	union recv_frame *precv_frame = (union recv_frame *)data;

	report_survey_event(adapter, precv_frame);
	return true;
}
u8 rtw_mi_report_survey_event(struct adapter *adapt, union recv_frame *precv_frame)
{
	return _rtw_mi_process(adapt, false, precv_frame, _rtw_mi_report_survey_event);
}
u8 rtw_mi_buddy_report_survey_event(struct adapter *adapt, union recv_frame *precv_frame)
{
	return _rtw_mi_process(adapt, true, precv_frame, _rtw_mi_report_survey_event);
}

static u8 _rtw_mi_sreset_adapter_hdl(struct adapter *adapter, void *data)
{
	u8 bstart = *(u8 *)data;

	if (bstart)
		sreset_start_adapter(adapter);
	else
		sreset_stop_adapter(adapter);
	return true;
}
u8 rtw_mi_sreset_adapter_hdl(struct adapter *adapt, u8 bstart)
{
	u8 in_data = bstart;

	return _rtw_mi_process(adapt, false, &in_data, _rtw_mi_sreset_adapter_hdl);
}
u8 rtw_mi_buddy_sfreset_adapter_hdl(struct adapter *adapt, u8 bstart)
{
	u8 in_data = bstart;

	return _rtw_mi_process(adapt, true, &in_data, _rtw_mi_sreset_adapter_hdl);
}
static u8 _rtw_mi_tx_beacon_hdl(struct adapter *adapter, void *data)
{
	if ((MLME_IS_AP(adapter) || MLME_IS_MESH(adapter)) &&
	    check_fwstate(&adapter->mlmepriv, WIFI_ASOC_STATE)) {
		adapter->mlmepriv.update_bcn = true;
		tx_beacon_hdl(adapter, NULL);
	}
	return true;
}
u8 rtw_mi_tx_beacon_hdl(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_tx_beacon_hdl);
}
u8 rtw_mi_buddy_tx_beacon_hdl(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_sreset_adapter_hdl);
}

static u8 _rtw_mi_set_tx_beacon_cmd(struct adapter *adapter, void *data)
{
	struct mlme_priv *pmlmepriv = &adapter->mlmepriv;

	if (MLME_IS_AP(adapter) || MLME_IS_MESH(adapter)) {
		if (pmlmepriv->update_bcn)
			set_tx_beacon_cmd(adapter);
	}
	return true;
}
u8 rtw_mi_set_tx_beacon_cmd(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, false, NULL, _rtw_mi_set_tx_beacon_cmd);
}
u8 rtw_mi_buddy_set_tx_beacon_cmd(struct adapter *adapt)
{
	return _rtw_mi_process(adapt, true, NULL, _rtw_mi_set_tx_beacon_cmd);
}

static u8 _rtw_mi_p2p_chk_state(struct adapter *adapter, void *data)
{
	struct wifidirect_info *pwdinfo = &(adapter->wdinfo);
	enum P2P_STATE state = *(enum P2P_STATE *)data;

	return rtw_p2p_chk_state(pwdinfo, state);
}
u8 rtw_mi_p2p_chk_state(struct adapter *adapt, enum P2P_STATE p2p_state)
{
	u8 in_data = p2p_state;

	return _rtw_mi_process(adapt, false, &in_data, _rtw_mi_p2p_chk_state);
}
u8 rtw_mi_buddy_p2p_chk_state(struct adapter *adapt, enum P2P_STATE p2p_state)
{
	u8 in_data  = p2p_state;

